openfoam/manufacturable_mesh_families/cases/coarse/constant/physicalProperties
FoamFile { format ascii; class dictionary; object physicalProperties; }

viscosityModel constant;
nu 1.48e-05;

