openfoam/manufacturable_mesh_families/cases/coarse/system/surfaceFeaturesDict
FoamFile { format ascii; class dictionary; object surfaceFeaturesDict; }

surfaces ("CargoUAV_partitioned_m.stl");
includedAngle 150;
subsetFeatures
{
    nonManifoldEdges no;
    openEdges yes;
}
